-- 1. Οι καλλιτέχνες (artist) που το όνομα τους αρχίζει από 'Κ' ή τελειώνει σε 'y'
-- σε αλφαβητική σειρά. [όλα τα στοιχεία των καλλιτεχνών]





-- 2. Το πλήθος των κομματιών (track) για κάθε καλλιτέχνη σε φθίνουσα κατάταξη
--    ως προς το πλήθος. [όνομα_καλλιτέχνη, πλήθος]





-- 3. Ο νεότερος εργαζόμενος.
--    [όλα τα στοιχεία του εργαζόμενου]


       
	   
	   
-- 4. Οι καλλιτέχνες που έχουν τουλάχιστον 2 album με είδος 'Metal'.
-- [όνομα_καλλιτέχνη, πλήθος_album]





-- 5. Για κάθε συνδυασμό φορμά ( media_type) και είδους μουσικής το πλήθος 
--    των κομματιών που έχει ταξινομημένα σε φθίνουσα σειρά πλήθους. 
--    Να εμφανίζονται και οι συνδυασμοί που δεν έχουν κανένα κομμάτι. 
--    [όνομα_φορμά, όνομα_είδους, πλήθος]





-- 6. Το τιμολόγιο με τα περισσότερα κομμάτια (invoiceline). 
--     [κωδικός_τιμολογίου, ημερομηνία, κωδικός_πελάτη, σύνολο, πλήθος]


	   
	   
	   
-- 7. Οι playlists που έχουν tracks και καλλιτεχνών που το όνομα τους αρχίζει από 'Α' και καλλιτεχνών 
-- που το όνομα τους αρχίζει από 'Μ'. [όλα τα στοιχεία της playlist]


 


-- 8. Οι playlist που έχουν track από όλα τα album με τίτλο που περιέχει τη λέξη 'best'.
--    [όλα τα στοιχεία των playlist]




   
-- 9. Ζεύγη εργαζομένων που έχουν τον ίδιο προϊστάμενο ταξινομημένοι αλφανητικά κατά επώνυμο_προϊσταμένου.
--    [επώνυμο_πρώτου_υπαλλήλου, όνομα_πρώτου_υπαλλήλου, επώνυμο_δεύτερου_υπαλλήλου, όνομα_δεύτερου_υπαλλήλου, επώνυμο_προϊσταμένου, όνομα_προϊσταμένου]


   
      

-- 10. Οι πελάτες που έχουν αγοράσει κομμάτια με είδος Classical αλλά όχι Opera. [όλα τα στοιχεία των πελατών]
